odasatoshi/m5stacktab/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Tab5: 16MB flash / 32MB HEX(x16) PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# 1280x720 の MIPI-DSI DPI はフレームバッファを PSRAM から読み続ける。
# 20MHz (P4 のデフォルト) では帯域が足りず "dpi underrun" が出続けるため 200MHz にする。
# 200MHz は IDF_EXPERIMENTAL_FEATURES 配下なので、その依存も明示的に有効化する。
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=n

# PSRAM からの読み出し効率を上げる（DPI の underrun 対策）
CONFIG_CACHE_L2_CACHE_512KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_CXX_EXCEPTIONS=y
